[
  { "name" : "Comparative Study for identifying Driver fingerprint using telematics data ", "heading" : "", "link" : "", "body" : "Derived driver fingerprints from anonymized driver trips and developed models to predict if a given trip was undertaken by said driver. Evaluated the performance of four different classifiers - SVM, Logistic Regression, Random Forest and Gradient Boosted Regression Trees. Also evaluated different dimensionality reduction techniques namely, PCA, ICA and LDA." },
  { "name" : "Ask through Tweets", "heading" : "", "link" : "/Askweet/", "body" : "Developed a prediction model using SVM for identifying machine answerable questions in tweets. Implemented a pipeline that involved 4 steps namely - data gathering, feature extraction, feature selection and training classifiers. Achieved an overall accuracy of 93%." },
  { "name" : "Project Valkyrie", "heading" : "A Distributed Key-Value storage system that provides Linearizability, Sequential Consistency and Eventual Consistency.", "link" : "/Valkyrie/", "body" : "Search function that displays the list of servers that store replicas of the key being searched. Display function that the key-value pairs stored on the node performing this command. Inconsistency Repair to tackle different replicas not being consistent with each other (due to eventual consistency). We have a monitoring tool that runs periodically and ensures that all replicas eventually receive all updates." },
  { "name" : "Project Chord", "heading" : "Implemented a peer-to-peer lookup service based on a popular research paper Chord: A Scalable Peer--to--Peer Lookup Service for Internet Applications", "link" : "/CHORD/", "body" : "In particular, implemented distributed key lookup and distributed node join. Reduced the number of messages that needs to be exchanged through piggybacking at each node." },
  { "name" : "Swear Jar 2.0 - BattleHack Chicago 2015", "heading" : "Hacking for good!", "link" : "/SwearJar2.0/", "body" : "Developed a virtual swear jar app with a twist. Integrated with the JustGiving and Venmo API, the application encourages friends to challenge each other to reduce swearing, while allowing the money collected in the jar to be donated to charity." },
  { "name" : "Data Visualizer Hack - HackIllinois 2015", "heading" : "Motivation - to help users better understand reviews when they make a search.", "link" : "/DataVisualizerHack/", "body" : "Worked on analyzing reviews from the yelp dataset, performing keyword extraction, sentiment analysis and generating a word cloud for beter summarization and visualization of the reviews. The system's generic capability will allow it to be used with any dataset." },
  { "name" : "PROM - Predicting Revenue of Movies", "heading" : "", "link" : "/PROM/", "body" : "A social network based approach to predict the revenue of movies using a collaboration network of actors and directors. Predicted the revenue of a movie using the influence score of each collaborator. Computed the influence score for each collaborator using hubs and authorities model by using the award and revenue scores from training." },
  { "name" : "Vortal for Sports and Technology", "heading" : "", "link" : "", "body" : "Built a vertical (domain-specific) search engine. Implemented a focused crawler to systematically fetch the web pages and index them only if they are domain relevant. The crawled web pages were subject to Link Analysis and Content Analysis to determine the Page Rank. Developed a web application for the user to make queries and see the ranked results." },
  { "name" : "WhichHangout Mobile App", "heading" : "", "link" : "", "body" : "Developed a Windows Phone Application for location-based searching. The application provides a way for people to search for nearby places like hospitals, banks and other points of interest." },
  { "name" : "Faculty Time Table Management System", "heading" : "", "link" : "", "body" : "Developed an application for the faculty to manage their timetable, records of classes, lab work, research and other activities and also analyze their work distribution." }
]
