[
	{
		"position": "Software Development Engineer", 
		"sdate": "Jan 2020 — Present", 
		"desc": {
			"num": 4, 
			"bullets": [
				"Optimized Twilio's voice connectivity routing stack for high throughput and low latency",
				"Enabling company wide intiatives like regional expansion, database migrations and regulatory compliance",
				"Design, review and implement various epics like fault tolerance, customer feature requests, regulatory enforcement and improving the codebase along the way",
				"Writing down learnings and discoveries to improve our knowledgebase."
				], 
			"heading": "Part of the Voice Connectivity and Trust team"
			}, 
		"employer": "Twilio"
	},
	{
		"position": "Software Development Engineer", 
		"sdate": "March 2017 — Dec 2019", 
		"desc": {
			"num": 4, 
			"bullets": [
				"Designed and implemented a content management tool using Ruby on Rails that supports a peer-based review system, a backend Java service to store and retrieve personalized search results, track customer impressions to drive analytics for measuring customer engagement.",
				"Designed and implemented an eventual consistency based solution for updating our NLU catalogs using DynamoDb locking mechanism and eliminated the use of additional storage.",
				"Added new backend APIs to render Alexa on a website and control device actions by overriding voice control, for an internal tool used by Amazon Researchers in conducting usability studies.",
				"Lead efforts to launch new conversational CX, that drives weekly engagement by 20%. Designed and implemented the ability to do A/B testing for launching new features, render conversational pleasantries based on weather and user interaction context with Alexa."
				], 
			"heading": "Worked on the Alexa Personality platform. My key deliveries include"
			}, 
		"employer": "Amazon"
	},
	{
		"position": "Software Development Engineer", 
		"sdate": "Feb 2016 — Feb 2017", 
		"desc": {
			"num": 4, 
			"bullets": [
				"Executing newly trained models in shadow mode prior to launch.",
				"Distributed sampling of transactions for model training.",
				"Reduced our data storage needs by 50% by tuning MapReduce jobs.",
				"Adding new APIs to support fraud scoring scenarios."
				], 
			"heading": "Worked on the Fraud Modeling platform. My key deliveries include"
			}, 
		"employer": "Expedia"
	},
	{
		"position": "Graduate Research Assistant", 
		"sdate": "Aug 2015 — Dec 2015", 
		"desc": {
			"num": 1, 
			"bullets": [
				"Responsible for planning and conducting data collection, analysis, reporting and dashboard creation for the independent evaluation of the XSEDE grant."
				], 
			"heading": ""
			}, 
		"employer": "I-STEM Education Initiative, UIUC"
	},
  	{
		"position": "Software Engineering Intern", 
	  	"sdate": "May 2015 — Aug 2015", 
	  	"desc": {
	  		"num": 3, 
	  		"bullets": [
	  			"Fixed the non-maximal suppression algorithm to provide better results", 
	  			"Conducted a survey of different deep learning frameworks.", 
	  			"Currently exploring the use of Torch7 framework for human speech detection using RNN"
	  			], 
	  		"heading": "Working on Neural Network projects."
	  		}, 
	  	"employer": "MulticoreWare Inc"
  	},
	{
		"position": "Graduate Research Assistant", 
		"sdate": "Sept 2014 — Feb 2015", 
		"desc": {
			"num": 4, 
			"bullets": [
				"Developed tools for information extraction, data analysis and storage.", 
				"Optimized search using grid search and machine learning (SVM).", 
				"Developed an incentive scheme that can generalize across applications.", 
				"Developed a dashboard that will help researchers choose and configure their mobile application."
				], 
			"heading": "Worked under Prof. Hari Sundaram"
			}, 
		"employer": "Dept of Computer Science, UIUC"
	},
	{
		"position": "Software Development Engineer in Test", 
		"sdate": "Jul 2013 — June 2014", 
		"desc": {
			"num": 3, 
			"bullets": [
				"Developed and enhanced internal web applications and automation framework.", 
				"Implemented test plans to verify and validate new features.", 
				"Analysed root causes of technical issues and performance bottlenecks."
				], 
			"heading": ""
			}, 
		"employer": "Akamai Technologies"
	},
	{
		"position": "Software Engineering Intern", 
		"sdate": "Feb 2013 — Apr 2013", 
		"desc": {
			"num": 1, 
			"bullets": [
				"Replaced the existing CGI script with a dynamic web application using PHP/AJAX and Bootstrap."
				], 
			"heading": ""
			}, 
		"employer": "Akamai Technologies"
	}
]
